ИСПП/src/Documents/ПроектЗадания/ПроектЗадания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ПроектЗадания</name>
  <basedOn>Document.СпецификацияКДоговору</basedOn>
  <registerRecords>AccumulationRegister.ИсполнениеПроектов</registerRecords>
  <attributes>
    <name>НомерПроекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ДобывающаяОрганизация</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерРазрешения</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлРазрешение</name>
    <type>
      <types>CatalogRef.ПроектЗаданияПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаВВалюте</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>16</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлРапорт</name>
    <type>
      <types>CatalogRef.ПроектЗаданияПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлСогласование</name>
    <type>
      <types>CatalogRef.ПроектЗаданияПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ФайлПроектЗадания</name>
    <type>
      <types>CatalogRef.ПроектЗаданияПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаСчетСредствФОИВ</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроизвольныйПредметПроекта</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеПредметаПроекта</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Гриф</name>
    <type>
      <types>CatalogRef.Грифы</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусЗадания</name>
    <type>
      <types>EnumRef.СтатусЗадания</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеВыполнения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Печать_ПредметЗадания</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Печать_ДляОбеспечения</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Печать_ОснованиеРабот</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Печать_ОрганизацияПотребитель</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Печать_Лицензия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Печать_ЦельИспользования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Печать_НаличиеВозможностей</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Печать_ФактыВыхода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФайлОбоснование</name>
    <type>
      <types>CatalogRef.ПроектЗаданияПрисоединенныеФайлы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Перечисления</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидДвижения</name>
      <type>
        <types>EnumRef.ВидДвижения</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Валюта</name>
      <type>
        <types>CatalogRef.Валюты</types>
      </type>
    </attributes>
    <attributes>
      <name>НомерПП</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Договор</name>
      <type>
        <types>CatalogRef.ДоговорыКонтрагентов</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаВВалютеПроекта</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПредметыПроекта</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИСПП/src/AccumulationRegisters/ИсполнениеПроектов/ИсполнениеПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ИсполнениеПроектов</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаПеречислено</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПроектЗадания</name>
    <type>
      <types>DocumentRef.ПроектЗадания</types>
      <types>DocumentRef.ГЗ</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

ИСПП/src/Enums/ВидДвижения/ВидДвижения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидДвижения</name>
  <enumValues>
    <name>Приход</name>
  </enumValues>
  <enumValues>
    <name>Расход</name>
  </enumValues>
</mdclass:Enum>

ИСПП/src/Documents/СпецификацияКДоговору/СпецификацияКДоговору.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СпецификацияКДоговору</name>
  <basedOn>Document.ПроектЗадания</basedOn>
  <basedOn>Document.ЗаявкаПредприятия</basedOn>
  <basedOn>Document.ГЗ</basedOn>
  <registerRecords>AccumulationRegister.ЗаказыПоставщикам</registerRecords>
  <registerRecords>AccumulationRegister.ИсполнениеЗаявокПредприятий</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ПроектЗадания</name>
    <type>
      <types>DocumentRef.ПроектЗадания</types>
      <types>DocumentRef.ГЗ</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ЦенаВключаетНДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <comment>Сумма в валюте документа, налоги включены согласно флагам</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>МаксимальныйКодСтроки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеОрганизации</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДоговорКонтрагента</name>
    <type>
      <types>CatalogRef.ДоговорыКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыСпецификацийКДоговорам</types>
    </type>
  </attributes>
  <attributes>
    <name>Партнер</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>НалогообложениеНДС</name>
    <type>
      <types>EnumRef.ТипыНалогообложенияНДС</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>НоменклатураПоставщика</name>
      <type>
        <types>CatalogRef.НоменклатураПоставщиков</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Цена</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <type>
        <types>EnumRef.СтавкиНДС</types>
      </type>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаСНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КодСтроки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НоменклатураПоЗаявкамПредприятий</name>
    <attributes>
      <name>ЗаявкаПредприятия</name>
      <type>
        <types>DocumentRef.ЗаявкаПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СвязанныеЗаявкиПредприятий</name>
    <attributes>
      <name>ЗаявкаПредприятия</name>
      <type>
        <types>DocumentRef.ЗаявкаПредприятия</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ИСПП/src/Documents/ПроектЗадания/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	ПредставлениеДокумента = ?(Данные.Проведен, "Задание", "Проект задания");
	Представление = ПредставлениеДокумента + " № " + Данные.НомерПроекта + " от " + Формат(Данные.Дата,"ДФ=dd.MM.yyyy" + ?(Данные.ЗаСчетСредствФОИВ, "*", ""));
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	Поля.Добавить("НомерПроекта");
	Поля.Добавить("Дата");
	Поля.Добавить("Проведен");
	Поля.Добавить("ЗаСчетСредствФОИВ");
	СтандартнаяОбработка = Ложь;
	
КонецПроцедуры
#КонецОбласти
	
#Область СлужебныеПроцедурыИФункции
// Сформировать таблицы движений для проведения.
// 
// Параметры:
//  ДополнительныеСвойства - Структура - Дополнительные свойства
//  Регистры - Неопределено - Регистры
Процедура СформироватьТаблицыДвиженийДляПроведения(ДополнительныеСвойства, Регистры = Неопределено) Экспорт
	
	ОсновныеДанныеДокумента = ПодготовитьОсновныеДанныеДляПроведения(ДополнительныеСвойства);
	

	ПроведениеПоддержкаПроектов.ДобавитьТекстЗапросаДвижений(ДополнительныеСвойства, ТекстЗапросаИсполнениеПроектов(), Метаданные.РегистрыНакопления.ИсполнениеПроектов);
	
	Запрос = Новый Запрос(ПроведениеПоддержкаПроектов.ПолучитьТекстЗапросаДвижений(ДополнительныеСвойства, Регистры));
	
	Для Каждого ДанныеДокумента Из ОсновныеДанныеДокумента Цикл
		Запрос.УстановитьПараметр(ДанныеДокумента.Ключ, ДанныеДокумента.Значение);
	КонецЦикла;
	
	ПроведениеПоддержкаПроектов.ЗаполнитьТаблицыДвижений(ДополнительныеСвойства, Запрос.ВыполнитьПакет(), Регистры);
	
КонецПроцедуры

Функция ПодготовитьОсновныеДанныеДляПроведения(ДополнительныеСвойства)
	
	ЗапрашиваемыеДанные = Новый Структура;
	ЗапрашиваемыеДанные.Вставить("Ссылка");
	ЗапрашиваемыеДанные.Вставить("Организация");
	ЗапрашиваемыеДанные.Вставить("Период", "Дата");
	ЗапрашиваемыеДанные.Вставить("Валюта");
	
	ОсновныеДанныеДокумента = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(
		ПроведениеПоддержкаПроектов.ПолучитьСсылкуНаДокументДляПроведения(ДополнительныеСвойства),
		ЗапрашиваемыеДанные);
		
	СтруктураКурсаДокумента = РаботаСКурсамиВалют.ПолучитьКурсВалюты(ОсновныеДанныеДокумента.Валюта, ОсновныеДанныеДокумента.Период);
	КоэффициентПересчетаВВалютуРегл = СтруктураКурсаДокумента.Курс / СтруктураКурсаДокумента.Кратность;
	ОсновныеДанныеДокумента.Вставить("КоэффициентПересчетаВВалютуРегл", КоэффициентПересчетаВВалютуРегл);
	
	ЗапасыСервер.ПриПодготовкеОсновныхДанныхДляПроведения(ДополнительныеСвойства, ОсновныеДанныеДокумента);
	
	Возврат ОсновныеДанныеДокумента;
	
КонецФункции

Функция ТекстЗапросаИсполнениеПроектов()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	1 КАК НомерСтроки,
	               |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
	               |	&Период КАК Период,
	               |	&Организация КАК Организация,
	               |	ПроектЗадания.Ссылка КАК ПроектЗадания,
	               |	NULL КАК Договор,
	               |	ПроектЗадания.Валюта КАК Валюта,
	               |	ПроектЗадания.СуммаВВалюте КАК Сумма,
	               |	NULL КАК СуммаПеречислено
	               |ИЗ
	               |	Документ.ПроектЗадания КАК ПроектЗадания
	               |ГДЕ
	               |	ПроектЗадания.Ссылка = &Ссылка
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
				   |	2 КАК НомерСтроки,
				   |	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Приход) КАК ВидДвижения,
				   |	ПроектЗаданияПеречисления.Дата КАК Период,
	               |	&Организация КАК Организация,
				   |	ПроектЗаданияПеречисления.Ссылка.Ссылка КАК ПроектЗадания,
				   |	ПроектЗаданияПеречисления.Договор КАК Договор,
				   |	ПроектЗаданияПеречисления.Валюта КАК Валюта,
				   |	NULL КАК Сумма,
	               |	ПроектЗаданияПеречисления.Сумма КАК СуммаПеречислено
	               |ИЗ
	               |	Документ.ПроектЗадания.Перечисления КАК ПроектЗаданияПеречисления
	               |ГДЕ
	               |	ПроектЗаданияПеречисления.Ссылка = &Ссылка
				   |	И ПроектЗаданияПеречисления.ВидДвижения = ЗНАЧЕНИЕ(Перечисление.ВидДвижения.Расход)";
	
	Возврат ТекстЗапроса;
	
КонецФункции



Процедура ДобавитьКомандыСоздатьНаОсновании(КомандыСоздатьНаОсновании, НастройкиФормы) Экспорт
	
	ВводНаОснованииПоддержкаПроектов.ДобавитьКомандыСоздатьНаОсновании(ПустаяСсылка().Метаданные().ПолноеИмя(), КомандыСоздатьНаОсновании, НастройкиФормы);
	
КонецПроцедуры

Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, НастройкиФормы) Экспорт
	
	МенюОтчетыПоддержкаПроектов.ДобавитьОбщиеКоманды(ПустаяСсылка().Метаданные().ПолноеИмя(), КомандыОтчетов, НастройкиФормы);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	УправлениеПечатьюПоддержкаПроектов.ДобавитьКомандыПечати(ПустаяСсылка().Метаданные().ПолноеИмя(), КомандыПечати);
	
КонецПроцедуры

// Возвращает список доступных печатных форм документа
// 
// Возвращаемое значение:
//  ТаблицаЗначений - Доступные печатные формы:
// * Идентификатор - Строка - 
// * Представление - Строка - 
// * МенеджерПечати - Неопределено 
// * ТипыОбъектовПечати - Неопределено - 
// * Обработчик - Строка - 
// * Порядок - Число - 
// * Картинка - Картинка - 
// * СписокФорм - Строка - 
// * МестоРазмещения - Строка - 
// * ЗаголовокФормы - Строка - 
// * ФункциональныеОпции - Строка - 
// * УсловияВидимости - Неопределено - 
// * ПроверкаПроведенияПередПечатью - Булево - 
// * СразуНаПринтер - Булево - 
// * ФорматСохранения - Неопределено
// * ПереопределитьПользовательскиеНастройкиКоличества - Булево - 
// * ДополнитьКомплектВнешнимиПечатнымиФормами - Булево - 
// * ФиксированныйКомплект - Булево - 
// * ДополнительныеПараметры - Структура - 
// * НеВыполнятьЗаписьВФорме - Булево - 
// * ТребуетсяРасширениеРаботыСФайлами - Булево - 
// * СкрытаФункциональнымиОпциями - Булево - 
// * УникальныйИдентификатор - Строка - 
// * Отключена - Булево - 
// * ИмяКомандыНаФорме - Строка - 
// * ПутьКМакету - Строка - 
// * КомандыПечати - ТаблицаЗначений - 
// * Роли - Строка - 
// * Параметризуемая - Булево - 
Функция ДоступныеПечатныеФормы() Экспорт
	
	ПечатныеФормы = УправлениеПечатьюПоддержкаПроектов.СоздатьКоллекциюДоступныхПечатныхФорм();
	
	МетаданныеДокумента = ПустаяСсылка().Метаданные();
	МенеджерПечати      = МетаданныеДокумента.ПолноеИмя();
	МетаданныеМакетов   = МетаданныеДокумента.Макеты;
	
	ПечатнаяФорма = УправлениеПечатьюПоддержкаПроектов.ДобавитьПечатнуюФорму(ПечатныеФормы, "ПаспортПроектаЗадания", МенеджерПечати);
	ПечатнаяФорма.Представление = МетаданныеМакетов.ПФ_MXL_Паспорт.Представление();
	ПечатнаяФорма.ПутьКМакету = ФормированиеПечатныхФормПоддержкаПроектов.ПутьКМакету(МетаданныеМакетов.ПФ_MXL_Паспорт);
	УправлениеПечатьюПоддержкаПроектов.ДобавитьКомандуПечати(ПечатнаяФорма);
	
	ПечатнаяФорма = УправлениеПечатьюПоддержкаПроектов.ДобавитьПечатнуюФорму(ПечатныеФормы, "ПроектЗадания", МенеджерПечати);
	ПечатнаяФорма.Представление = МетаданныеМакетов.ПФ_MXL_Проект.Представление();
	ПечатнаяФорма.ПутьКМакету = ФормированиеПечатныхФормПоддержкаПроектов.ПутьКМакету(МетаданныеМакетов.ПФ_MXL_Проект);
	УправлениеПечатьюПоддержкаПроектов.ДобавитьКомандуПечати(ПечатнаяФорма);
	
	ПечатнаяФорма = УправлениеПечатьюПоддержкаПроектов.ДобавитьПечатнуюФорму(ПечатныеФормы, "ОтчетПоЗаданию", МенеджерПечати);
	ПечатнаяФорма.Представление = МетаданныеМакетов.ПФ_MXL_ОтчетПоЗаданию.Представление();
	ПечатнаяФорма.ПутьКМакету = ФормированиеПечатныхФормПоддержкаПроектов.ПутьКМакету(МетаданныеМакетов.ПФ_MXL_ОтчетПоЗаданию);
	УправлениеПечатьюПоддержкаПроектов.ДобавитьКомандуПечати(ПечатнаяФорма);
	
	Возврат ПечатныеФормы;
	
КонецФункции

Функция ПечатьПаспортПроектаЗадания(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб        = Истина;
	
	ПолноеИмяМакета = ФормированиеПечатныхФормПоддержкаПроектов.ПутьКМакету(ПустаяСсылка().Метаданные().Макеты.ПФ_MXL_Паспорт);
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_" + ПолноеИмяМакета;
	Макет = УправлениеПечатью.МакетПечатнойФормы(ПолноеИмяМакета);
	
	МассивВыводимыхОбластей = Новый Массив();
	
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаДанныеДляПечати();
	Запрос.УстановитьПараметр("ТекущийДокумент", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	Пока Шапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
				
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(Шапка.Ссылка, ТабличныйДокумент, Макет);
		
		// Получение параметров для заполнения
		ПараметрыИзШапки = ПолучитьПараметрыШапкиПаспортПроектаЗадания(Шапка);
		
		// Вывод области Шапка
		ФормированиеПечатныхФормПоддержкаПроектов.ВывестиОбластьПоИмени(ТабличныйДокумент, Макет, "Шапка", ПараметрыИзШапки);
		
		Если Шапка.ПроизвольныйПредметПроекта Тогда
			ДанныеСтроки = Новый Структура("ПредметИСостав, Количество, Расходы", Шапка.НаименованиеПредметаПроекта, 1, Шапка.СуммаВВалюте + " " + Шапка.Валюта);
		    ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
			ОбластьСтрока.Параметры.Заполнить(ДанныеСтроки);
							
			Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабличныйДокумент, МассивВыводимыхОбластей) Тогда
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
			КонецЕсли;
			
			// Вывод области Строка
			ТабличныйДокумент.Вывести(ОбластьСтрока);	
		Иначе
			ТоварыПоНоменклатуре = Шапка.ПредметыПроекта.Выгрузить();
			
			ТДСтроки = Новый ТабличныйДокумент();
			Для Каждого ВыборкаСтрокТовары Из ТоварыПоНоменклатуре Цикл
					
				ДанныеСтроки = Новый Структура("ПредметИСостав, Количество, Расходы", ВыборкаСтрокТовары.Номенклатура, ВыборкаСтрокТовары.Количество, Формат(Шапка.СуммаВВалюте, "ЧГ=") + " " + Строка(Шапка.Валюта));
			    ОбластьСтрока = Макет.ПолучитьОбласть("Строка");
				ОбластьСтрока.Параметры.Заполнить(ДанныеСтроки);
								
				Если Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабличныйДокумент, МассивВыводимыхОбластей) Тогда
					ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				КонецЕсли;
				
				// Вывод области Строка
				ТДСтроки.Вывести(ОбластьСтрока);
					
			КонецЦикла;
			
			Первая = 1;
			Последняя = ТДСтроки.ВысотаТаблицы;
			Ячейка = ТДСтроки.Область(Первая, 10,Последняя,12);
			Ячейка.Объединить();
			//Ячейка.Текст = Строка(Шапка.СуммаВВалюте) + " " + Строка(Шапка.Валюта);
			
			ТабличныйДокумент.Вывести(ТДСтроки);
		КонецЕсли;
				
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПолучитьПараметрыШапкиПаспортПроектаЗадания(Шапка)
	
	Параметры = Новый Структура();
	
	Параметры.Вставить("ИндексЗадания", Шапка.НомерПроекта + ?(Шапка.ЗаСчетСредствФОИВ, "*",""));
	Параметры.Вставить("ДатаДокумента", Формат(Шапка.ДатаДокумента, "ДЛФ=Д"));
	Параметры.Вставить("ДО", Шапка.ДобывающаяОрганизация);
	Параметры.Вставить("Гриф", Шапка.Гриф);
	
	Возврат Параметры;
	
КонецФункции

Функция ПечатьПроектЗадания(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.АвтоМасштаб        = Истина;
	
	ПолноеИмяМакета = ФормированиеПечатныхФормПоддержкаПроектов.ПутьКМакету(ПустаяСсылка().Метаданные().Макеты.ПФ_MXL_Проект);
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_" + ПолноеИмяМакета;
	Макет = УправлениеПечатью.МакетПечатнойФормы(ПолноеИмяМакета);
		
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаДанныеДляПечати();
	Запрос.УстановитьПараметр("ТекущийДокумент", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	Пока Шапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
				
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(Шапка.Ссылка, ТабличныйДокумент, Макет);
		
		// Получение параметров для заполнения
		ПараметрыИзШапки = ПолучитьПараметрыШапкиПроектЗадания(Шапка);
		
		// Вывод областей страниц
		ФормированиеПечатныхФормПоддержкаПроектов.ВывестиОбластьПоИмени(ТабличныйДокумент, Макет, "Страница1", ПараметрыИзШапки);
		ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		ФормированиеПечатныхФормПоддержкаПроектов.ВывестиОбластьПоИмени(ТабличныйДокумент, Макет, "Страница2", ПараметрыИзШапки);
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПолучитьПараметрыШапкиПроектЗадания(Шапка)
	
	Параметры = Новый Структура();
	
	Обоснование = "";
	Если ЗначениеЗаполнено(Шапка.Ссылка.ФайлОбоснование) Тогда
		Попытка
			Обоснование = Шапка.Ссылка.ФайлОбоснование.ТекстХранилище.Получить();
		Исключение
			Обоснование = "";
		КонецПопытки;
	КонецЕсли;
	Параметры.Вставить("Ссылка", Шапка.Ссылка);
	Параметры.Вставить("ИндексЗадания", Шапка.НомерПроекта + ?(Шапка.ЗаСчетСредствФОИВ, "*",""));
	Параметры.Вставить("ЗаСчетСредствФОИВ", Шапка.ЗаСчетСредствФОИВ);
	Параметры.Вставить("ЗаСчетСредствФОИВТекст", ?(Шапка.ЗаСчетСредствФОИВ,"(за средства ФСО России)", ""));
	Параметры.Вставить("ДатаДокумента", Формат(Шапка.ДатаДокумента, "ДЛФ=Д"));
	Параметры.Вставить("ДО", Шапка.ДобывающаяОрганизация);
	Параметры.Вставить("Гриф", Шапка.Гриф);
	Параметры.Вставить("ПредметЗадания", Шапка.Печать_ПредметЗадания);
	Параметры.Вставить("Материал", Шапка.Печать_ДляОбеспечения);
	Параметры.Вставить("Основание", Шапка.Печать_ОснованиеРабот);
	Параметры.Вставить("НачалоПроекта", Формат(Шапка.НачалоВыполнения, "ДЛФ=Д"));
	Параметры.Вставить("ОкончаниеПроекта", Формат(Шапка.ОкончаниеВыполнения, "ДЛФ=Д"));
	Параметры.Вставить("ОрганизацияПотребитель", Шапка.Печать_ОрганизацияПотребитель);
	Параметры.Вставить("Лицензия", Шапка.Печать_Лицензия);
	Параметры.Вставить("Цель", Шапка.Печать_ЦельИспользования);
	Параметры.Вставить("Обоснование", Обоснование);
	Параметры.Вставить("Освоение", Шапка.Печать_НаличиеВозможностей);
	Параметры.Вставить("ВыходНаПроизводителя", Шапка.Печать_ФактыВыхода);
	Параметры.Вставить("СуммаВВалюте", Шапка.СуммаВВалюте);
	Параметры.Вставить("Валюта", Шапка.Валюта);
	
	Возврат Параметры;
	
КонецФункции

Функция ПолучитьТекстЗапросаДанныеДляПечати()
	
	ТекстЗапроса = "ВЫБРАТЬ
	               |	ПроектЗадания.Ссылка КАК Ссылка,
	               |	ПроектЗадания.ВерсияДанных КАК ВерсияДанных,
	               |	ПроектЗадания.ПометкаУдаления КАК ПометкаУдаления,
	               |	ПроектЗадания.Номер КАК НомерДокумента,
	               |	ПроектЗадания.Дата КАК ДатаДокумента,
	               |	ПроектЗадания.НомерПроекта КАК НомерПроекта,
	               |	ПроектЗадания.Организация КАК Организация,
	               |	ПроектЗадания.ДобывающаяОрганизация КАК ДобывающаяОрганизация,
	               |	ПроектЗадания.Ответственный КАК Ответственный,
	               |	ПроектЗадания.НомерРазрешения КАК НомерРазрешения,
	               |	ПроектЗадания.Валюта КАК Валюта,
	               |	ПроектЗадания.СуммаВВалюте КАК СуммаВВалюте,
	               |	ПроектЗадания.ЗаСчетСредствФОИВ КАК ЗаСчетСредствФОИВ,
	               |	ПроектЗадания.Комментарий КАК Комментарий,
	               |	ПроектЗадания.Автор КАК Автор,
	               |	ПроектЗадания.ПроизвольныйПредметПроекта КАК ПроизвольныйПредметПроекта,
	               |	ПроектЗадания.НаименованиеПредметаПроекта КАК НаименованиеПредметаПроекта,
	               |	ПроектЗадания.Гриф КАК Гриф,
	               |	ПроектЗадания.СтатусЗадания КАК СтатусЗадания,
	               |	ПроектЗадания.ПредметыПроекта.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество
	               |	) КАК ПредметыПроекта,
	               |	ПроектЗадания.НачалоВыполнения КАК НачалоВыполнения,
	               |	ПроектЗадания.ОкончаниеВыполнения КАК ОкончаниеВыполнения,
	               |	ПроектЗадания.Печать_ПредметЗадания КАК Печать_ПредметЗадания,
	               |	ПроектЗадания.Печать_ДляОбеспечения КАК Печать_ДляОбеспечения,
	               |	ПроектЗадания.Печать_ОснованиеРабот КАК Печать_ОснованиеРабот,
	               |	ПроектЗадания.Печать_ОрганизацияПотребитель КАК Печать_ОрганизацияПотребитель,
	               |	ПроектЗадания.Печать_Лицензия КАК Печать_Лицензия,
	               |	ПроектЗадания.Печать_ЦельИспользования КАК Печать_ЦельИспользования,
	               |	ПроектЗадания.Печать_НаличиеВозможностей КАК Печать_НаличиеВозможностей,
	               |	ПроектЗадания.Печать_ФактыВыхода КАК Печать_ФактыВыхода
	               |ИЗ
	               |	Документ.ПроектЗадания КАК ПроектЗадания
	               |ГДЕ
	               |	ПроектЗадания.Ссылка В(&ТекущийДокумент)";
	
	Возврат ТекстЗапроса;
	
КонецФункции

Функция ПечатьОтчетПоЗаданию(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.АвтоМасштаб        = Истина;
	
	ПолноеИмяМакета = ФормированиеПечатныхФормПоддержкаПроектов.ПутьКМакету(ПустаяСсылка().Метаданные().Макеты.ПФ_MXL_ОтчетПоЗаданию);
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_" + ПолноеИмяМакета;
	Макет = УправлениеПечатью.МакетПечатнойФормы(ПолноеИмяМакета);
		
	Запрос = Новый Запрос;
	Запрос.Текст = ПолучитьТекстЗапросаДанныеДляПечати();
	Запрос.УстановитьПараметр("ТекущийДокумент", МассивОбъектов);
	
	Шапка = Запрос.Выполнить().Выбрать();
	
	ПервыйДокумент = Истина;
	Пока Шапка.Следующий() Цикл
		
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
				
		ПервыйДокумент = Ложь;
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ШтрихкодированиеПечатныхФорм.ВывестиШтрихкодВТабличныйДокумент(Шапка.Ссылка, ТабличныйДокумент, Макет);
		
		// Получение параметров для заполнения
		ПараметрыИзШапки = ПолучитьПараметрыШапкиПроектЗадания(Шапка);
		
		Дата = ТекущаяДатаСеанса();
		ПараметрыИзШапки.Вставить("Дата", Формат(Дата, "ДЛФ=Д"));
		
		ПараметрыИзШапки.Вставить("ВалютаРегламентированногоУчета", Константы.ВалютаРегламентированногоУчета.Получить());
		
		ЗапросБалансаПроекта = Новый Запрос();
		ЗапросБалансаПроекта.Текст = "ВЫБРАТЬ
		                             |	СУММА(ИсполнениеПроектовОстатки.СуммаОстаток) КАК СуммаОстаток,
		                             |	СУММА(ИсполнениеПроектовОстатки.СуммаПеречисленоОстаток) КАК СуммаПеречисленоОстаток
		                             |ИЗ
		                             |	РегистрНакопления.ИсполнениеПроектов.Остатки(&Дата, ПроектЗадания = &ПроектЗадания) КАК ИсполнениеПроектовОстатки";
		ЗапросБалансаПроекта.УстановитьПараметр("Дата", Дата);
		ЗапросБалансаПроекта.УстановитьПараметр("ПроектЗадания", ПараметрыИзШапки.Ссылка);
		//@skip-warning
		ВыборкаБаланса = ЗапросБалансаПроекта.Выполнить().Выбрать();
		Если ВыборкаБаланса.Следующий() Тогда
			ПараметрыИзШапки.Вставить("СуммаОстаток", Формат(ВыборкаБаланса.СуммаОстаток, "ЧДЦ=2"));
			Если ПараметрыИзШапки.ЗаСчетСредствФОИВ Тогда
				ПараметрыИзШапки.Вставить("СуммаПеречисленоОстаток", Формат(ВыборкаБаланса.СуммаПеречисленоОстаток, "ЧДЦ=2"));	
			КонецЕсли;
		КонецЕсли;
		
		// Вывод областей страниц
		ФормированиеПечатныхФормПоддержкаПроектов.ВывестиОбластьПоИмени(ТабличныйДокумент, Макет, "Шапка", ПараметрыИзШапки);
		
		Запрос = Новый Запрос();
		Запрос.Текст = "ВЫБРАТЬ
		               |	СпецификацияКДоговоруТовары.Номенклатура.Наименование КАК Наименование,
		               |	СпецификацияКДоговоруТовары.Количество КАК Количество,
		               |	СпецификацияКДоговоруТовары.Цена КАК Цена,
		               |	СпецификацияКДоговоруТовары.СуммаСНДС КАК Сумма
		               |ИЗ
		               |	Документ.СпецификацияКДоговору.Товары КАК СпецификацияКДоговоруТовары
		               |ГДЕ
		               |	СпецификацияКДоговоруТовары.Ссылка.ПроектЗадания = &ПроектЗадания";
		Запрос.УстановитьПараметр("ПроектЗадания", Шапка.Ссылка);
		//@skip-warning
		Выборка = Запрос.Выполнить().Выбрать();
		НомерПП = 0;
		Пока выборка.Следующий() Цикл
			НомерПП = НомерПП + 1;
			//@skip-warning
			СтруктураЗаполнения = Новый Структура("НомерПП, Наименование, Количество, Цена, Сумма");
			ЗаполнитьЗначенияСвойств(СтруктураЗаполнения, Выборка);
			СтруктураЗаполнения.НомерПП = НомерПП;
			ФормированиеПечатныхФормПоддержкаПроектов.ВывестиОбластьПоИмени(ТабличныйДокумент, Макет, "Строка", СтруктураЗаполнения);
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
		
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции
#КонецОбласти

#КонецЕсли
